system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v13                                   |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;          // Modular solver entry point
solver          shockFluid;

startFrom       latestTime;
startTime       0;

stopAt          endTime;
endTime         10;                // Total simulation time (seconds)

deltaT          1e-2;                // Small initial time step for transient

writeControl    adjustableRunTime;            // 
//writeControl    timeStep;            // Write every N time steps
writeInterval   0.1;                   // Write every time step

purgeWrite      0;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;
maxCo           0.5;                 // Conservative CFL for shock stability
maxDeltaT       1e-2;

// ************************************************************************* //

