constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicRefineFvMesh;

ftopoChanger
{
    type            refiner;

    libs            ("libfvMeshTopoChangers.so");

    mover           none;

    // How often to refine
    refineInterval  100;

    // Field to be refinement on
    field           refinementFieldNorm;

    // Refine field in between lower..upper
    lowerRefineLevel 0.5;
    upperRefineLevel 1e15;

    // Have slower than 2:1 refinement
    nBufferLayers   2;

    // Refine cells only up to maxRefinement levels
    maxRefinement   4;

    // Stop refinement if maxCells reached
    maxCells        20000000;

    // Write the refinement level as a volScalarField
    dumpLevel       false;
}

// ************************************************************************* //
