constant/sphere.geo
// Sphere definition
Sphere(1) = {0,0,0, 2}; // Creates a sphere with radius 5 at the origin

// Volume creation
Volume(1) = {1};

// Mesh generation
Mesh 3; // Generates a 3D mesh

