system/variables
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield        | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration    | Version:  13                                    |
|   \\  /    A nd          | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      variables;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


U_in  #calc "4*sqrt(1.4)";

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
